export const WORD_DESCRIPTION = {
  両面: [
    "りゃんめん",
    "あと１枚揃うと最後の順子が作れる状態の時、両端のどちらが来ても完成できる状態のこと（例:「34」があるときの両面は2と5）",
  ],
  字牌: ["じはい", "漢字一文字のみが書かれた牌や、何も書かれていない牌"],
  数牌: [
    "かずはい",
    "数字が書かれた牌。萬子（マンズ）、筒子（ピンズ）、索子（ソウズ）の3種類が存在する",
  ],
  頭: ["あたま", "同じ種類の牌2枚1組のこと"],
  対子: ["といつ", "2枚の同じ種類の牌が揃った状態のこと"],
  順子: ["しゅんつ", "3枚連続した数牌を揃えること"],
  刻子: [
    "こーつ",
    "同じ種類の牌が3つ揃っていること。暗刻、明刻のことをまとめて面子と呼ぶ",
  ],
  暗刻: ["あんこ", "ポンをしないで自分の手牌の中に同じ種類の牌が3つ揃っている"],
  明刻: ["みんこ", "ポンをして同じ種類の牌が3つ揃っている"],
  面子: ["めんつ", "順子、刻子のことをまとめて面子と呼ぶ"],
  自風: ["じかぜ", "自分の方角のこと。親から反時計回りに東南西北の順で変わる"],
  場風: ["ばかぜ", "「東1局」の「東」のこと。1周することで方角が変わる"],
  向聴数: [
    "しゃんてんすう",
    "アガり状態からどれだけ離れているかを示す。(例: 向聴数2の場合は)",
  ],
  聴牌: ["てんぱい", "あと一つ有効な牌を引けばアガれる状態"],
  ツモ: [
    "",
    "アガれる状態で有効な牌を引いたときにできる。そのときの手牌に応じて得点がもらえる",
  ],
};
